SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG22/Include/efr32fg22_rfsense.h
/**************************************************************************//**
 * @file
 * @brief EFR32FG22 RFSENSE register and bit field definitions
 ******************************************************************************
 * # License
 * <b>Copyright 2022 Silicon Laboratories, Inc. www.silabs.com</b>
 ******************************************************************************
 *
 * SPDX-License-Identifier: Zlib
 *
 * The licensor of this software is Silicon Laboratories Inc.
 *
 * This software is provided 'as-is', without any express or implied
 * warranty. In no event will the authors be held liable for any damages
 * arising from the use of this software.
 *
 * Permission is granted to anyone to use this software for any purpose,
 * including commercial applications, and to alter it and redistribute it
 * freely, subject to the following restrictions:
 *
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software. If you use this software
 *    in a product, an acknowledgment in the product documentation would be
 *    appreciated but is not required.
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.
 * 3. This notice may not be removed or altered from any source distribution.
 *
 *****************************************************************************/
#ifndef EFR32FG22_RFSENSE_H
#define EFR32FG22_RFSENSE_H
#define RFSENSE_HAS_SET_CLEAR

/**************************************************************************//**
* @addtogroup Parts
* @{
******************************************************************************/
/**************************************************************************//**
 * @defgroup EFR32FG22_RFSENSE RFSENSE
 * @{
 * @brief EFR32FG22 RFSENSE Register Declaration.
 *****************************************************************************/

/** RFSENSE Register Declaration. */
typedef struct {
  __IOM uint32_t EN;                            /**< Module Enable register                             */
  __IOM uint32_t EM4WUEN;                       /**< EM4 WakeUp Enable                                  */
  __IOM uint32_t CFG;                           /**< RFSENSE Digital Config                             */
  __IOM uint32_t SYNCWORD;                      /**< SYNCWORD                                           */
  __IOM uint32_t THDSEL;                        /**< RFSENSE Threshold Select                           */
  uint32_t       RESERVED0[3U];                 /**< Reserved for future use                            */
  __IOM uint32_t IF;                            /**< Interrupt Flag register                            */
  __IOM uint32_t IEN;                           /**< Interrupt Enable register                          */
  __IOM uint32_t CALCFG;                        /**< Calibration Config register                        */
  __IOM uint32_t RFEN;                          /**< Config register                                    */
  __IOM uint32_t MODESEL;                       /**< Mode Select                                        */
  __IOM uint32_t CMPCONF;                       /**< Comparator Config                                  */
  __IOM uint32_t TRIMPTAT;                      /**< Trim PTAT                                          */
  __IOM uint32_t TRIMBG;                        /**< Trim BandGap                                       */
  __IOM uint32_t TRIMDAC;                       /**< Trim RFSENSE DAC                                   */
  __IOM uint32_t SPARE;                         /**< Spare register                                     */
  uint32_t       RESERVED1[6U];                 /**< Reserved for future use                            */
  __IOM uint32_t SWCTRL;                        /**< Software Control                                   */
  __IOM uint32_t DIAGCTRL;                      /**< Diagnostic Control                                 */
  __IM uint32_t  STATUS;                        /**< Status Register                                    */
  uint32_t       RESERVED2[997U];               /**< Reserved for future use                            */
  __IOM uint32_t EN_SET;                        /**< Module Enable register                             */
  __IOM uint32_t EM4WUEN_SET;                   /**< EM4 WakeUp Enable                                  */
  __IOM uint32_t CFG_SET;                       /**< RFSENSE Digital Config                             */
  __IOM uint32_t SYNCWORD_SET;                  /**< SYNCWORD                                           */
  __IOM uint32_t THDSEL_SET;                    /**< RFSENSE Threshold Select                           */
  uint32_t       RESERVED3[3U];                 /**< Reserved for future use                            */
  __IOM uint32_t IF_SET;                        /**< Interrupt Flag register                            */
  __IOM uint32_t IEN_SET;                       /**< Interrupt Enable register                          */
  __IOM uint32_t CALCFG_SET;                    /**< Calibration Config register                        */
  __IOM uint32_t RFEN_SET;                      /**< Config register                                    */
  __IOM uint32_t MODESEL_SET;                   /**< Mode Select                                        */
  __IOM uint32_t CMPCONF_SET;                   /**< Comparator Config                                  */
  __IOM uint32_t TRIMPTAT_SET;                  /**< Trim PTAT                                          */
  __IOM uint32_t TRIMBG_SET;                    /**< Trim BandGap                                       */
  __IOM uint32_t TRIMDAC_SET;                   /**< Trim RFSENSE DAC                                   */
  __IOM uint32_t SPARE_SET;                     /**< Spare register                                     */
  uint32_t       RESERVED4[6U];                 /**< Reserved for future use                            */
  __IOM uint32_t SWCTRL_SET;                    /**< Software Control                                   */
  __IOM uint32_t DIAGCTRL_SET;                  /**< Diagnostic Control                                 */
  __IM uint32_t  STATUS_SET;                    /**< Status Register                                    */
  uint32_t       RESERVED5[997U];               /**< Reserved for future use                            */
  __IOM uint32_t EN_CLR;                        /**< Module Enable register                             */
  __IOM uint32_t EM4WUEN_CLR;                   /**< EM4 WakeUp Enable                                  */
  __IOM uint32_t CFG_CLR;                       /**< RFSENSE Digital Config                             */
  __IOM uint32_t SYNCWORD_CLR;                  /**< SYNCWORD                                           */
  __IOM uint32_t THDSEL_CLR;                    /**< RFSENSE Threshold Select                           */
  uint32_t       RESERVED6[3U];                 /**< Reserved for future use                            */
  __IOM uint32_t IF_CLR;                        /**< Interrupt Flag register                            */
  __IOM uint32_t IEN_CLR;                       /**< Interrupt Enable register                          */
  __IOM uint32_t CALCFG_CLR;                    /**< Calibration Config register                        */
  __IOM uint32_t RFEN_CLR;                      /**< Config register                                    */
  __IOM uint32_t MODESEL_CLR;                   /**< Mode Select                                        */
  __IOM uint32_t CMPCONF_CLR;                   /**< Comparator Config                                  */
  __IOM uint32_t TRIMPTAT_CLR;                  /**< Trim PTAT                                          */
  __IOM uint32_t TRIMBG_CLR;                    /**< Trim BandGap                                       */
  __IOM uint32_t TRIMDAC_CLR;                   /**< Trim RFSENSE DAC                                   */
  __IOM uint32_t SPARE_CLR;                     /**< Spare register                                     */
  uint32_t       RESERVED7[6U];                 /**< Reserved for future use                            */
  __IOM uint32_t SWCTRL_CLR;                    /**< Software Control                                   */
  __IOM uint32_t DIAGCTRL_CLR;                  /**< Diagnostic Control                                 */
  __IM uint32_t  STATUS_CLR;                    /**< Status Register                                    */
  uint32_t       RESERVED8[997U];               /**< Reserved for future use                            */
  __IOM uint32_t EN_TGL;                        /**< Module Enable register                             */
  __IOM uint32_t EM4WUEN_TGL;                   /**< EM4 WakeUp Enable                                  */
  __IOM uint32_t CFG_TGL;                       /**< RFSENSE Digital Config                             */
  __IOM uint32_t SYNCWORD_TGL;                  /**< SYNCWORD                                           */
  __IOM uint32_t THDSEL_TGL;                    /**< RFSENSE Threshold Select                           */
  uint32_t       RESERVED9[3U];                 /**< Reserved for future use                            */
  __IOM uint32_t IF_TGL;                        /**< Interrupt Flag register                            */
  __IOM uint32_t IEN_TGL;                       /**< Interrupt Enable register                          */
  __IOM uint32_t CALCFG_TGL;                    /**< Calibration Config register                        */
  __IOM uint32_t RFEN_TGL;                      /**< Config register                                    */
  __IOM uint32_t MODESEL_TGL;                   /**< Mode Select                                        */
  __IOM uint32_t CMPCONF_TGL;                   /**< Comparator Config                                  */
  __IOM uint32_t TRIMPTAT_TGL;                  /**< Trim PTAT                                          */
  __IOM uint32_t TRIMBG_TGL;                    /**< Trim BandGap                                       */
  __IOM uint32_t TRIMDAC_TGL;                   /**< Trim RFSENSE DAC                                   */
  __IOM uint32_t SPARE_TGL;                     /**< Spare register                                     */
  uint32_t       RESERVED10[6U];                /**< Reserved for future use                            */
  __IOM uint32_t SWCTRL_TGL;                    /**< Software Control                                   */
  __IOM uint32_t DIAGCTRL_TGL;                  /**< Diagnostic Control                                 */
  __IM uint32_t  STATUS_TGL;                    /**< Status Register                                    */
} RFSENSE_TypeDef;
/** @} End of group EFR32FG22_RFSENSE */

/**************************************************************************//**
 * @addtogroup EFR32FG22_RFSENSE
 * @{
 * @defgroup EFR32FG22_RFSENSE_BitFields RFSENSE Bit Fields
 * @{
 *****************************************************************************/

/* Bit fields for RFSENSE EN */
#define _RFSENSE_EN_RESETVALUE                   0x00000000UL                           /**< Default value for RFSENSE_EN                */
#define _RFSENSE_EN_MASK                         0x00000001UL                           /**< Mask for RFSENSE_EN                         */
#define RFSENSE_EN_EN                            (0x1UL << 0)                           /**< RFSENSE Enable                              */
#define _RFSENSE_EN_EN_SHIFT                     0                                      /**< Shift value for RFSENSE_EN                  */
#define _RFSENSE_EN_EN_MASK                      0x1UL                                  /**< Bit mask for RFSENSE_EN                     */
#define _RFSENSE_EN_EN_DEFAULT                   0x00000000UL                           /**< Mode DEFAULT for RFSENSE_EN                 */
#define RFSENSE_EN_EN_DEFAULT                    (_RFSENSE_EN_EN_DEFAULT << 0)          /**< Shifted mode DEFAULT for RFSENSE_EN         */

/* Bit fields for RFSENSE EM4WUEN */
#define _RFSENSE_EM4WUEN_RESETVALUE              0x00000000UL                            /**< Default value for RFSENSE_EM4WUEN           */
#define _RFSENSE_EM4WUEN_MASK                    0x00000001UL                            /**< Mask for RFSENSE_EM4WUEN                    */
#define RFSENSE_EM4WUEN_EM4WUEN                  (0x1UL << 0)                            /**< EM4 WakeUp Enable                           */
#define _RFSENSE_EM4WUEN_EM4WUEN_SHIFT           0                                       /**< Shift value for RFSENSE_EM4WUEN             */
#define _RFSENSE_EM4WUEN_EM4WUEN_MASK            0x1UL                                   /**< Bit mask for RFSENSE_EM4WUEN                */
#define _RFSENSE_EM4WUEN_EM4WUEN_DEFAULT         0x00000000UL                            /**< Mode DEFAULT for RFSENSE_EM4WUEN            */
#define RFSENSE_EM4WUEN_EM4WUEN_DEFAULT          (_RFSENSE_EM4WUEN_EM4WUEN_DEFAULT << 0) /**< Shifted mode DEFAULT for RFSENSE_EM4WUEN    */

/* Bit fields for RFSENSE CFG */
#define _RFSENSE_CFG_RESETVALUE                  0x03800000UL                            /**< Default value for RFSENSE_CFG               */
#define _RFSENSE_CFG_MASK                        0x0780000DUL                            /**< Mask for RFSENSE_CFG                        */
#define RFSENSE_CFG_PREAMBLELEN                  (0x1UL << 0)                            /**< Number of Preamble bits                     */
#define _RFSENSE_CFG_PREAMBLELEN_SHIFT           0                                       /**< Shift value for RFSENSE_PREAMBLELEN         */
#define _RFSENSE_CFG_PREAMBLELEN_MASK            0x1UL                                   /**< Bit mask for RFSENSE_PREAMBLELEN            */
#define _RFSENSE_CFG_PREAMBLELEN_DEFAULT         0x00000000UL                            /**< Mode DEFAULT for RFSENSE_CFG                */
#define RFSENSE_CFG_PREAMBLELEN_DEFAULT          (_RFSENSE_CFG_PREAMBLELEN_DEFAULT << 0) /**< Shifted mode DEFAULT for RFSENSE_CFG        */
#define _RFSENSE_CFG_SYNCWORDLEN_SHIFT           2                                       /**< Shift value for RFSENSE_SYNCWORDLEN         */
#define _RFSENSE_CFG_SYNCWORDLEN_MASK            0xCUL                                   /**< Bit mask for RFSENSE_SYNCWORDLEN            */
#define _RFSENSE_CFG_SYNCWORDLEN_DEFAULT         0x00000000UL                            /**< Mode DEFAULT for RFSENSE_CFG                */
#define RFSENSE_CFG_SYNCWORDLEN_DEFAULT          (_RFSENSE_CFG_SYNCWORDLEN_DEFAULT << 2) /**< Shifted mode DEFAULT for RFSENSE_CFG        */
#define _RFSENSE_CFG_ENERGYDUR_SHIFT             23                                      /**< Shift value for RFSENSE_ENERGYDUR           */
#define _RFSENSE_CFG_ENERGYDUR_MASK              0x3800000UL                             /**< Bit mask for RFSENSE_ENERGYDUR              */
#define _RFSENSE_CFG_ENERGYDUR_DEFAULT           0x00000007UL                            /**< Mode DEFAULT for RFSENSE_CFG                */
#define _RFSENSE_CFG_ENERGYDUR_dur1ms            0x00000000UL                            /**< Mode dur1ms for RFSENSE_CFG                 */
#define _RFSENSE_CFG_ENERGYDUR_dur2ms            0x00000001UL                            /**< Mode dur2ms for RFSENSE_CFG                 */
#define _RFSENSE_CFG_ENERGYDUR_dur4ms            0x00000002UL                            /**< Mode dur4ms for RFSENSE_CFG                 */
#define _RFSENSE_CFG_ENERGYDUR_dur8ms            0x00000003UL                            /**< Mode dur8ms for RFSENSE_CFG                 */
#define _RFSENSE_CFG_ENERGYDUR_dur16ms           0x00000004UL                            /**< Mode dur16ms for RFSENSE_CFG                */
#define _RFSENSE_CFG_ENERGYDUR_dur32ms           0x00000005UL                            /**< Mode dur32ms for RFSENSE_CFG                */
#define _RFSENSE_CFG_ENERGYDUR_dur64ms           0x00000006UL                            /**< Mode dur64ms for RFSENSE_CFG                */
#define _RFSENSE_CFG_ENERGYDUR_dur128ms          0x00000007UL                            /**< Mode dur128ms for RFSENSE_CFG               */
#define RFSENSE_CFG_ENERGYDUR_DEFAULT            (_RFSENSE_CFG_ENERGYDUR_DEFAULT << 23)  /**< Shifted mode DEFAULT for RFSENSE_CFG        */
#define RFSENSE_CFG_ENERGYDUR_dur1ms             (_RFSENSE_CFG_ENERGYDUR_dur1ms << 23)   /**< Shifted mode dur1ms for RFSENSE_CFG         */
#define RFSENSE_CFG_ENERGYDUR_dur2ms             (_RFSENSE_CFG_ENERGYDUR_dur2ms << 23)   /**< Shifted mode dur2ms for RFSENSE_CFG         */
#define RFSENSE_CFG_ENERGYDUR_dur4ms             (_RFSENSE_CFG_ENERGYDUR_dur4ms << 23)   /**< Shifted mode dur4ms for RFSENSE_CFG         */
#define RFSENSE_CFG_ENERGYDUR_dur8ms             (_RFSENSE_CFG_ENERGYDUR_dur8ms << 23)   /**< Shifted mode dur8ms for RFSENSE_CFG         */
#define RFSENSE_CFG_ENERGYDUR_dur16ms            (_RFSENSE_CFG_ENERGYDUR_dur16ms << 23)  /**< Shifted mode dur16ms for RFSENSE_CFG        */
#define RFSENSE_CFG_ENERGYDUR_dur32ms            (_RFSENSE_CFG_ENERGYDUR_dur32ms << 23)  /**< Shifted mode dur32ms for RFSENSE_CFG        */
#define RFSENSE_CFG_ENERGYDUR_dur64ms            (_RFSENSE_CFG_ENERGYDUR_dur64ms << 23)  /**< Shifted mode dur64ms for RFSENSE_CFG        */
#define RFSENSE_CFG_ENERGYDUR_dur128ms           (_RFSENSE_CFG_ENERGYDUR_dur128ms << 23) /**< Shifted mode dur128ms for RFSENSE_CFG       */
#define RFSENSE_CFG_LEGACYMODE                   (0x1UL << 26)                           /**< RFSENSE Legacy Mode                         */
#define _RFSENSE_CFG_LEGACYMODE_SHIFT            26                                      /**< Shift value for RFSENSE_LEGACYMODE          */
#define _RFSENSE_CFG_LEGACYMODE_MASK             0x4000000UL                             /**< Bit mask for RFSENSE_LEGACYMODE             */
#define _RFSENSE_CFG_LEGACYMODE_DEFAULT          0x00000000UL                            /**< Mode DEFAULT for RFSENSE_CFG                */
#define RFSENSE_CFG_LEGACYMODE_DEFAULT           (_RFSENSE_CFG_LEGACYMODE_DEFAULT << 26) /**< Shifted mode DEFAULT for RFSENSE_CFG        */

