SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG22/Include/efr32fg22_rfsense.h
/* Bit fields for RFSENSE SYNCWORD */
#define _RFSENSE_SYNCWORD_RESETVALUE             0x00000000UL                              /**< Default value for RFSENSE_SYNCWORD          */
#define _RFSENSE_SYNCWORD_MASK                   0xFFFFFFFFUL                              /**< Mask for RFSENSE_SYNCWORD                   */
#define _RFSENSE_SYNCWORD_SYNCWORD_SHIFT         0                                         /**< Shift value for RFSENSE_SYNCWORD            */
#define _RFSENSE_SYNCWORD_SYNCWORD_MASK          0xFFFFFFFFUL                              /**< Bit mask for RFSENSE_SYNCWORD               */
#define _RFSENSE_SYNCWORD_SYNCWORD_DEFAULT       0x00000000UL                              /**< Mode DEFAULT for RFSENSE_SYNCWORD           */
#define RFSENSE_SYNCWORD_SYNCWORD_DEFAULT        (_RFSENSE_SYNCWORD_SYNCWORD_DEFAULT << 0) /**< Shifted mode DEFAULT for RFSENSE_SYNCWORD   */

/* Bit fields for RFSENSE THDSEL */
#define _RFSENSE_THDSEL_RESETVALUE               0x00000080UL                           /**< Default value for RFSENSE_THDSEL            */
#define _RFSENSE_THDSEL_MASK                     0x000000FFUL                           /**< Mask for RFSENSE_THDSEL                     */
#define _RFSENSE_THDSEL_THDSEL_SHIFT             0                                      /**< Shift value for RFSENSE_THDSEL              */
#define _RFSENSE_THDSEL_THDSEL_MASK              0xFFUL                                 /**< Bit mask for RFSENSE_THDSEL                 */
#define _RFSENSE_THDSEL_THDSEL_DEFAULT           0x00000080UL                           /**< Mode DEFAULT for RFSENSE_THDSEL             */
#define RFSENSE_THDSEL_THDSEL_DEFAULT            (_RFSENSE_THDSEL_THDSEL_DEFAULT << 0)  /**< Shifted mode DEFAULT for RFSENSE_THDSEL     */

/* Bit fields for RFSENSE IF */
#define _RFSENSE_IF_RESETVALUE                   0x00000000UL                           /**< Default value for RFSENSE_IF                */
#define _RFSENSE_IF_MASK                         0x00000003UL                           /**< Mask for RFSENSE_IF                         */
#define RFSENSE_IF_RFSENSE                       (0x1UL << 0)                           /**< RFSENSE Interrupt Flag                      */
#define _RFSENSE_IF_RFSENSE_SHIFT                0                                      /**< Shift value for RFSENSE_RFSENSE             */
#define _RFSENSE_IF_RFSENSE_MASK                 0x1UL                                  /**< Bit mask for RFSENSE_RFSENSE                */
#define _RFSENSE_IF_RFSENSE_DEFAULT              0x00000000UL                           /**< Mode DEFAULT for RFSENSE_IF                 */
#define RFSENSE_IF_RFSENSE_DEFAULT               (_RFSENSE_IF_RFSENSE_DEFAULT << 0)     /**< Shifted mode DEFAULT for RFSENSE_IF         */
#define RFSENSE_IF_SEQ                           (0x1UL << 1)                           /**< Sequencer Interrupt Flag                    */
#define _RFSENSE_IF_SEQ_SHIFT                    1                                      /**< Shift value for RFSENSE_SEQ                 */
#define _RFSENSE_IF_SEQ_MASK                     0x2UL                                  /**< Bit mask for RFSENSE_SEQ                    */
#define _RFSENSE_IF_SEQ_DEFAULT                  0x00000000UL                           /**< Mode DEFAULT for RFSENSE_IF                 */
#define RFSENSE_IF_SEQ_DEFAULT                   (_RFSENSE_IF_SEQ_DEFAULT << 1)         /**< Shifted mode DEFAULT for RFSENSE_IF         */

/* Bit fields for RFSENSE IEN */
#define _RFSENSE_IEN_RESETVALUE                  0x00000000UL                           /**< Default value for RFSENSE_IEN               */
#define _RFSENSE_IEN_MASK                        0x00000003UL                           /**< Mask for RFSENSE_IEN                        */
#define RFSENSE_IEN_RFSENSE                      (0x1UL << 0)                           /**< RFSENSE Interrrupt Enable                   */
#define _RFSENSE_IEN_RFSENSE_SHIFT               0                                      /**< Shift value for RFSENSE_RFSENSE             */
#define _RFSENSE_IEN_RFSENSE_MASK                0x1UL                                  /**< Bit mask for RFSENSE_RFSENSE                */
#define _RFSENSE_IEN_RFSENSE_DEFAULT             0x00000000UL                           /**< Mode DEFAULT for RFSENSE_IEN                */
#define RFSENSE_IEN_RFSENSE_DEFAULT              (_RFSENSE_IEN_RFSENSE_DEFAULT << 0)    /**< Shifted mode DEFAULT for RFSENSE_IEN        */
#define RFSENSE_IEN_SEQ                          (0x1UL << 1)                           /**< Sequencer Interrupt Enable                  */
#define _RFSENSE_IEN_SEQ_SHIFT                   1                                      /**< Shift value for RFSENSE_SEQ                 */
#define _RFSENSE_IEN_SEQ_MASK                    0x2UL                                  /**< Bit mask for RFSENSE_SEQ                    */
#define _RFSENSE_IEN_SEQ_DEFAULT                 0x00000000UL                           /**< Mode DEFAULT for RFSENSE_IEN                */
#define RFSENSE_IEN_SEQ_DEFAULT                  (_RFSENSE_IEN_SEQ_DEFAULT << 1)        /**< Shifted mode DEFAULT for RFSENSE_IEN        */

/* Bit fields for RFSENSE CALCFG */
#define _RFSENSE_CALCFG_RESETVALUE               0x01050010UL                                 /**< Default value for RFSENSE_CALCFG            */
#define _RFSENSE_CALCFG_MASK                     0x130F70FFUL                                 /**< Mask for RFSENSE_CALCFG                     */
#define _RFSENSE_CALCFG_CALPERIOD_SHIFT          0                                            /**< Shift value for RFSENSE_CALPERIOD           */
#define _RFSENSE_CALCFG_CALPERIOD_MASK           0xFFUL                                       /**< Bit mask for RFSENSE_CALPERIOD              */
#define _RFSENSE_CALCFG_CALPERIOD_DEFAULT        0x00000010UL                                 /**< Mode DEFAULT for RFSENSE_CALCFG             */
#define RFSENSE_CALCFG_CALPERIOD_DEFAULT         (_RFSENSE_CALCFG_CALPERIOD_DEFAULT << 0)     /**< Shifted mode DEFAULT for RFSENSE_CALCFG     */
#define RFSENSE_CALCFG_DISCMCAL                  (0x1UL << 12)                                /**< Disable Common Mode Calibration             */
#define _RFSENSE_CALCFG_DISCMCAL_SHIFT           12                                           /**< Shift value for RFSENSE_DISCMCAL            */
#define _RFSENSE_CALCFG_DISCMCAL_MASK            0x1000UL                                     /**< Bit mask for RFSENSE_DISCMCAL               */
#define _RFSENSE_CALCFG_DISCMCAL_DEFAULT         0x00000000UL                                 /**< Mode DEFAULT for RFSENSE_CALCFG             */
#define RFSENSE_CALCFG_DISCMCAL_DEFAULT          (_RFSENSE_CALCFG_DISCMCAL_DEFAULT << 12)     /**< Shifted mode DEFAULT for RFSENSE_CALCFG     */
#define RFSENSE_CALCFG_DISPTATCAL                (0x1UL << 13)                                /**< Disable PTAT Calibration                    */
#define _RFSENSE_CALCFG_DISPTATCAL_SHIFT         13                                           /**< Shift value for RFSENSE_DISPTATCAL          */
#define _RFSENSE_CALCFG_DISPTATCAL_MASK          0x2000UL                                     /**< Bit mask for RFSENSE_DISPTATCAL             */
#define _RFSENSE_CALCFG_DISPTATCAL_DEFAULT       0x00000000UL                                 /**< Mode DEFAULT for RFSENSE_CALCFG             */
#define RFSENSE_CALCFG_DISPTATCAL_DEFAULT        (_RFSENSE_CALCFG_DISPTATCAL_DEFAULT << 13)   /**< Shifted mode DEFAULT for RFSENSE_CALCFG     */
#define RFSENSE_CALCFG_ENCALPUP                  (0x1UL << 14)                                /**< Enable Calibration at Power Up              */
#define _RFSENSE_CALCFG_ENCALPUP_SHIFT           14                                           /**< Shift value for RFSENSE_ENCALPUP            */
#define _RFSENSE_CALCFG_ENCALPUP_MASK            0x4000UL                                     /**< Bit mask for RFSENSE_ENCALPUP               */
#define _RFSENSE_CALCFG_ENCALPUP_DEFAULT         0x00000000UL                                 /**< Mode DEFAULT for RFSENSE_CALCFG             */
#define RFSENSE_CALCFG_ENCALPUP_DEFAULT          (_RFSENSE_CALCFG_ENCALPUP_DEFAULT << 14)     /**< Shifted mode DEFAULT for RFSENSE_CALCFG     */
#define _RFSENSE_CALCFG_PTATCALSTEPS_SHIFT       16                                           /**< Shift value for RFSENSE_PTATCALSTEPS        */
#define _RFSENSE_CALCFG_PTATCALSTEPS_MASK        0x30000UL                                    /**< Bit mask for RFSENSE_PTATCALSTEPS           */
#define _RFSENSE_CALCFG_PTATCALSTEPS_DEFAULT     0x00000001UL                                 /**< Mode DEFAULT for RFSENSE_CALCFG             */
#define _RFSENSE_CALCFG_PTATCALSTEPS_STEPS2      0x00000000UL                                 /**< Mode STEPS2 for RFSENSE_CALCFG              */
#define _RFSENSE_CALCFG_PTATCALSTEPS_STEPS4      0x00000001UL                                 /**< Mode STEPS4 for RFSENSE_CALCFG              */
#define _RFSENSE_CALCFG_PTATCALSTEPS_STEPS6      0x00000002UL                                 /**< Mode STEPS6 for RFSENSE_CALCFG              */
#define _RFSENSE_CALCFG_PTATCALSTEPS_STEPS8      0x00000003UL                                 /**< Mode STEPS8 for RFSENSE_CALCFG              */
#define RFSENSE_CALCFG_PTATCALSTEPS_DEFAULT      (_RFSENSE_CALCFG_PTATCALSTEPS_DEFAULT << 16) /**< Shifted mode DEFAULT for RFSENSE_CALCFG     */
#define RFSENSE_CALCFG_PTATCALSTEPS_STEPS2       (_RFSENSE_CALCFG_PTATCALSTEPS_STEPS2 << 16)  /**< Shifted mode STEPS2 for RFSENSE_CALCFG      */
#define RFSENSE_CALCFG_PTATCALSTEPS_STEPS4       (_RFSENSE_CALCFG_PTATCALSTEPS_STEPS4 << 16)  /**< Shifted mode STEPS4 for RFSENSE_CALCFG      */
#define RFSENSE_CALCFG_PTATCALSTEPS_STEPS6       (_RFSENSE_CALCFG_PTATCALSTEPS_STEPS6 << 16)  /**< Shifted mode STEPS6 for RFSENSE_CALCFG      */
#define RFSENSE_CALCFG_PTATCALSTEPS_STEPS8       (_RFSENSE_CALCFG_PTATCALSTEPS_STEPS8 << 16)  /**< Shifted mode STEPS8 for RFSENSE_CALCFG      */
#define _RFSENSE_CALCFG_CMCALSTEPS_SHIFT         18                                           /**< Shift value for RFSENSE_CMCALSTEPS          */
#define _RFSENSE_CALCFG_CMCALSTEPS_MASK          0xC0000UL                                    /**< Bit mask for RFSENSE_CMCALSTEPS             */
#define _RFSENSE_CALCFG_CMCALSTEPS_DEFAULT       0x00000001UL                                 /**< Mode DEFAULT for RFSENSE_CALCFG             */
#define _RFSENSE_CALCFG_CMCALSTEPS_STEPS2        0x00000000UL                                 /**< Mode STEPS2 for RFSENSE_CALCFG              */
#define _RFSENSE_CALCFG_CMCALSTEPS_STEPS4        0x00000001UL                                 /**< Mode STEPS4 for RFSENSE_CALCFG              */
#define _RFSENSE_CALCFG_CMCALSTEPS_STEPS6        0x00000002UL                                 /**< Mode STEPS6 for RFSENSE_CALCFG              */
#define _RFSENSE_CALCFG_CMCALSTEPS_STEPS8        0x00000003UL                                 /**< Mode STEPS8 for RFSENSE_CALCFG              */
#define RFSENSE_CALCFG_CMCALSTEPS_DEFAULT        (_RFSENSE_CALCFG_CMCALSTEPS_DEFAULT << 18)   /**< Shifted mode DEFAULT for RFSENSE_CALCFG     */
#define RFSENSE_CALCFG_CMCALSTEPS_STEPS2         (_RFSENSE_CALCFG_CMCALSTEPS_STEPS2 << 18)    /**< Shifted mode STEPS2 for RFSENSE_CALCFG      */
#define RFSENSE_CALCFG_CMCALSTEPS_STEPS4         (_RFSENSE_CALCFG_CMCALSTEPS_STEPS4 << 18)    /**< Shifted mode STEPS4 for RFSENSE_CALCFG      */
#define RFSENSE_CALCFG_CMCALSTEPS_STEPS6         (_RFSENSE_CALCFG_CMCALSTEPS_STEPS6 << 18)    /**< Shifted mode STEPS6 for RFSENSE_CALCFG      */
#define RFSENSE_CALCFG_CMCALSTEPS_STEPS8         (_RFSENSE_CALCFG_CMCALSTEPS_STEPS8 << 18)    /**< Shifted mode STEPS8 for RFSENSE_CALCFG      */
#define _RFSENSE_CALCFG_CALSTEPCLKS_SHIFT        24                                           /**< Shift value for RFSENSE_CALSTEPCLKS         */
#define _RFSENSE_CALCFG_CALSTEPCLKS_MASK         0x3000000UL                                  /**< Bit mask for RFSENSE_CALSTEPCLKS            */
#define _RFSENSE_CALCFG_CALSTEPCLKS_DEFAULT      0x00000001UL                                 /**< Mode DEFAULT for RFSENSE_CALCFG             */
#define RFSENSE_CALCFG_CALSTEPCLKS_DEFAULT       (_RFSENSE_CALCFG_CALSTEPCLKS_DEFAULT << 24)  /**< Shifted mode DEFAULT for RFSENSE_CALCFG     */
#define RFSENSE_CALCFG_PTATCALMODE               (0x1UL << 28)                                /**< PTAT Calibration mode                       */
#define _RFSENSE_CALCFG_PTATCALMODE_SHIFT        28                                           /**< Shift value for RFSENSE_PTATCALMODE         */
#define _RFSENSE_CALCFG_PTATCALMODE_MASK         0x10000000UL                                 /**< Bit mask for RFSENSE_PTATCALMODE            */
#define _RFSENSE_CALCFG_PTATCALMODE_DEFAULT      0x00000000UL                                 /**< Mode DEFAULT for RFSENSE_CALCFG             */
#define RFSENSE_CALCFG_PTATCALMODE_DEFAULT       (_RFSENSE_CALCFG_PTATCALMODE_DEFAULT << 28)  /**< Shifted mode DEFAULT for RFSENSE_CALCFG     */

/* Bit fields for RFSENSE RFEN */
#define _RFSENSE_RFEN_RESETVALUE                 0x00000060UL                           /**< Default value for RFSENSE_RFEN              */
#define _RFSENSE_RFEN_MASK                       0x0000007FUL                           /**< Mask for RFSENSE_RFEN                       */
#define RFSENSE_RFEN_ENBG                        (0x1UL << 0)                           /**< Enable Bandgap                              */
#define _RFSENSE_RFEN_ENBG_SHIFT                 0                                      /**< Shift value for RFSENSE_ENBG                */
#define _RFSENSE_RFEN_ENBG_MASK                  0x1UL                                  /**< Bit mask for RFSENSE_ENBG                   */
#define _RFSENSE_RFEN_ENBG_DEFAULT               0x00000000UL                           /**< Mode DEFAULT for RFSENSE_RFEN               */
#define RFSENSE_RFEN_ENBG_DEFAULT                (_RFSENSE_RFEN_ENBG_DEFAULT << 0)      /**< Shifted mode DEFAULT for RFSENSE_RFEN       */
#define RFSENSE_RFEN_BGSTART                     (0x1UL << 1)                           /**< Bandgap Startup Signal                      */
#define _RFSENSE_RFEN_BGSTART_SHIFT              1                                      /**< Shift value for RFSENSE_BGSTART             */
#define _RFSENSE_RFEN_BGSTART_MASK               0x2UL                                  /**< Bit mask for RFSENSE_BGSTART                */
#define _RFSENSE_RFEN_BGSTART_DEFAULT            0x00000000UL                           /**< Mode DEFAULT for RFSENSE_RFEN               */
#define RFSENSE_RFEN_BGSTART_DEFAULT             (_RFSENSE_RFEN_BGSTART_DEFAULT << 1)   /**< Shifted mode DEFAULT for RFSENSE_RFEN       */
#define RFSENSE_RFEN_PTATISO                     (0x1UL << 2)                           /**< Isolate PTAT core                           */
#define _RFSENSE_RFEN_PTATISO_SHIFT              2                                      /**< Shift value for RFSENSE_PTATISO             */
#define _RFSENSE_RFEN_PTATISO_MASK               0x4UL                                  /**< Bit mask for RFSENSE_PTATISO                */
#define _RFSENSE_RFEN_PTATISO_DEFAULT            0x00000000UL                           /**< Mode DEFAULT for RFSENSE_RFEN               */
#define RFSENSE_RFEN_PTATISO_DEFAULT             (_RFSENSE_RFEN_PTATISO_DEFAULT << 2)   /**< Shifted mode DEFAULT for RFSENSE_RFEN       */
#define RFSENSE_RFEN_PTATSTART                   (0x1UL << 3)                           /**< PTAT Startup signal                         */
#define _RFSENSE_RFEN_PTATSTART_SHIFT            3                                      /**< Shift value for RFSENSE_PTATSTART           */
#define _RFSENSE_RFEN_PTATSTART_MASK             0x8UL                                  /**< Bit mask for RFSENSE_PTATSTART              */
#define _RFSENSE_RFEN_PTATSTART_DEFAULT          0x00000000UL                           /**< Mode DEFAULT for RFSENSE_RFEN               */
#define RFSENSE_RFEN_PTATSTART_DEFAULT           (_RFSENSE_RFEN_PTATSTART_DEFAULT << 3) /**< Shifted mode DEFAULT for RFSENSE_RFEN       */
#define RFSENSE_RFEN_SUPFLTN                     (0x1UL << 4)                           /**< Disable supply filtering                    */
#define _RFSENSE_RFEN_SUPFLTN_SHIFT              4                                      /**< Shift value for RFSENSE_SUPFLTN             */
#define _RFSENSE_RFEN_SUPFLTN_MASK               0x10UL                                 /**< Bit mask for RFSENSE_SUPFLTN                */
#define _RFSENSE_RFEN_SUPFLTN_DEFAULT            0x00000000UL                           /**< Mode DEFAULT for RFSENSE_RFEN               */
#define RFSENSE_RFEN_SUPFLTN_DEFAULT             (_RFSENSE_RFEN_SUPFLTN_DEFAULT << 4)   /**< Shifted mode DEFAULT for RFSENSE_RFEN       */
#define RFSENSE_RFEN_DCEN                        (0x1UL << 5)                           /**< DC Bias Enable                              */
#define _RFSENSE_RFEN_DCEN_SHIFT                 5                                      /**< Shift value for RFSENSE_DCEN                */
#define _RFSENSE_RFEN_DCEN_MASK                  0x20UL                                 /**< Bit mask for RFSENSE_DCEN                   */
#define _RFSENSE_RFEN_DCEN_DEFAULT               0x00000001UL                           /**< Mode DEFAULT for RFSENSE_RFEN               */
#define RFSENSE_RFEN_DCEN_DEFAULT                (_RFSENSE_RFEN_DCEN_DEFAULT << 5)      /**< Shifted mode DEFAULT for RFSENSE_RFEN       */
#define RFSENSE_RFEN_RESETN                      (0x1UL << 6)                           /**< Reset RFSENSE data flop                     */
#define _RFSENSE_RFEN_RESETN_SHIFT               6                                      /**< Shift value for RFSENSE_RESETN              */
#define _RFSENSE_RFEN_RESETN_MASK                0x40UL                                 /**< Bit mask for RFSENSE_RESETN                 */
#define _RFSENSE_RFEN_RESETN_DEFAULT             0x00000001UL                           /**< Mode DEFAULT for RFSENSE_RFEN               */
#define RFSENSE_RFEN_RESETN_DEFAULT              (_RFSENSE_RFEN_RESETN_DEFAULT << 6)    /**< Shifted mode DEFAULT for RFSENSE_RFEN       */

/* Bit fields for RFSENSE MODESEL */
#define _RFSENSE_MODESEL_RESETVALUE              0x00000000UL                               /**< Default value for RFSENSE_MODESEL           */
#define _RFSENSE_MODESEL_MASK                    0x00000007UL                               /**< Mask for RFSENSE_MODESEL                    */
#define _RFSENSE_MODESEL_MODESEL_SHIFT           0                                          /**< Shift value for RFSENSE_MODESEL             */
#define _RFSENSE_MODESEL_MODESEL_MASK            0x7UL                                      /**< Bit mask for RFSENSE_MODESEL                */
#define _RFSENSE_MODESEL_MODESEL_DEFAULT         0x00000000UL                               /**< Mode DEFAULT for RFSENSE_MODESEL            */
#define _RFSENSE_MODESEL_MODESEL_NORMAL_OP       0x00000000UL                               /**< Mode NORMAL_OP for RFSENSE_MODESEL          */
#define _RFSENSE_MODESEL_MODESEL_CM_CAL          0x00000001UL                               /**< Mode CM_CAL for RFSENSE_MODESEL             */
#define _RFSENSE_MODESEL_MODESEL_REF_CAL         0x00000002UL                               /**< Mode REF_CAL for RFSENSE_MODESEL            */
#define _RFSENSE_MODESEL_MODESEL_NORMAL_OP2      0x00000003UL                               /**< Mode NORMAL_OP2 for RFSENSE_MODESEL         */
#define _RFSENSE_MODESEL_MODESEL_DM_A_CAL        0x00000004UL                               /**< Mode DM_A_CAL for RFSENSE_MODESEL           */
#define _RFSENSE_MODESEL_MODESEL_DM_B_CAL        0x00000005UL                               /**< Mode DM_B_CAL for RFSENSE_MODESEL           */
#define _RFSENSE_MODESEL_MODESEL_DM_A_CAL2       0x00000006UL                               /**< Mode DM_A_CAL2 for RFSENSE_MODESEL          */
#define _RFSENSE_MODESEL_MODESEL_DM_B_CAL2       0x00000007UL                               /**< Mode DM_B_CAL2 for RFSENSE_MODESEL          */
#define RFSENSE_MODESEL_MODESEL_DEFAULT          (_RFSENSE_MODESEL_MODESEL_DEFAULT << 0)    /**< Shifted mode DEFAULT for RFSENSE_MODESEL    */
#define RFSENSE_MODESEL_MODESEL_NORMAL_OP        (_RFSENSE_MODESEL_MODESEL_NORMAL_OP << 0)  /**< Shifted mode NORMAL_OP for RFSENSE_MODESEL  */
#define RFSENSE_MODESEL_MODESEL_CM_CAL           (_RFSENSE_MODESEL_MODESEL_CM_CAL << 0)     /**< Shifted mode CM_CAL for RFSENSE_MODESEL     */
#define RFSENSE_MODESEL_MODESEL_REF_CAL          (_RFSENSE_MODESEL_MODESEL_REF_CAL << 0)    /**< Shifted mode REF_CAL for RFSENSE_MODESEL    */
#define RFSENSE_MODESEL_MODESEL_NORMAL_OP2       (_RFSENSE_MODESEL_MODESEL_NORMAL_OP2 << 0) /**< Shifted mode NORMAL_OP2 for RFSENSE_MODESEL */
#define RFSENSE_MODESEL_MODESEL_DM_A_CAL         (_RFSENSE_MODESEL_MODESEL_DM_A_CAL << 0)   /**< Shifted mode DM_A_CAL for RFSENSE_MODESEL   */
#define RFSENSE_MODESEL_MODESEL_DM_B_CAL         (_RFSENSE_MODESEL_MODESEL_DM_B_CAL << 0)   /**< Shifted mode DM_B_CAL for RFSENSE_MODESEL   */
#define RFSENSE_MODESEL_MODESEL_DM_A_CAL2        (_RFSENSE_MODESEL_MODESEL_DM_A_CAL2 << 0)  /**< Shifted mode DM_A_CAL2 for RFSENSE_MODESEL  */
#define RFSENSE_MODESEL_MODESEL_DM_B_CAL2        (_RFSENSE_MODESEL_MODESEL_DM_B_CAL2 << 0)  /**< Shifted mode DM_B_CAL2 for RFSENSE_MODESEL  */

/* Bit fields for RFSENSE CMPCONF */
#define _RFSENSE_CMPCONF_RESETVALUE              0x00000000UL                           /**< Default value for RFSENSE_CMPCONF           */
#define _RFSENSE_CMPCONF_MASK                    0x00000007UL                           /**< Mask for RFSENSE_CMPCONF                    */
#define RFSENSE_CMPCONF_CHP                      (0x1UL << 0)                           /**< Invert Comparator IO                        */
#define _RFSENSE_CMPCONF_CHP_SHIFT               0                                      /**< Shift value for RFSENSE_CHP                 */
#define _RFSENSE_CMPCONF_CHP_MASK                0x1UL                                  /**< Bit mask for RFSENSE_CHP                    */
#define _RFSENSE_CMPCONF_CHP_DEFAULT             0x00000000UL                           /**< Mode DEFAULT for RFSENSE_CMPCONF            */
#define RFSENSE_CMPCONF_CHP_DEFAULT              (_RFSENSE_CMPCONF_CHP_DEFAULT << 0)    /**< Shifted mode DEFAULT for RFSENSE_CMPCONF    */
#define RFSENSE_CMPCONF_HYS                      (0x1UL << 1)                           /**< Enable Hysteresis                           */
#define _RFSENSE_CMPCONF_HYS_SHIFT               1                                      /**< Shift value for RFSENSE_HYS                 */
#define _RFSENSE_CMPCONF_HYS_MASK                0x2UL                                  /**< Bit mask for RFSENSE_HYS                    */
#define _RFSENSE_CMPCONF_HYS_DEFAULT             0x00000000UL                           /**< Mode DEFAULT for RFSENSE_CMPCONF            */
#define RFSENSE_CMPCONF_HYS_DEFAULT              (_RFSENSE_CMPCONF_HYS_DEFAULT << 1)    /**< Shifted mode DEFAULT for RFSENSE_CMPCONF    */
#define RFSENSE_CMPCONF_PLSN                     (0x1UL << 2)                           /**< Disable Comparator reset pulse              */
#define _RFSENSE_CMPCONF_PLSN_SHIFT              2                                      /**< Shift value for RFSENSE_PLSN                */
#define _RFSENSE_CMPCONF_PLSN_MASK               0x4UL                                  /**< Bit mask for RFSENSE_PLSN                   */
#define _RFSENSE_CMPCONF_PLSN_DEFAULT            0x00000000UL                           /**< Mode DEFAULT for RFSENSE_CMPCONF            */
#define RFSENSE_CMPCONF_PLSN_DEFAULT             (_RFSENSE_CMPCONF_PLSN_DEFAULT << 2)   /**< Shifted mode DEFAULT for RFSENSE_CMPCONF    */

